#+PROPERTY: session *shell*
#+PROPERTY: results output
#+PROPERTY: exports both

* Unpack the data

#+BEGIN_SRC sh :results silent
  mkdir hadisd2012
#+END_SRC


#+BEGIN_SRC sh

  for file in WMO_???000-???999.tar.gz; do
    echo -n "$file : "
    tar --checkpoint=.100000 --skip-old-files --directory=hadisd2012 -xzf $file 2>&1
    echo
  done
  
#+END_SRC

#+RESULTS:
#+begin_example

> > > WMO_000000-099999.tar.gz : .....................
WMO_100000-199999.tar.gz : ...............
WMO_200000-299999.tar.gz : ..........
WMO_300000-399999.tar.gz : ...........
WMO_400000-499999.tar.gz : ...........
WMO_500000-599999.tar.gz : ........
WMO_600000-699999.tar.gz : ........
WMO_700000-719999.tar.gz : .................
WMO_720000-724999.tar.gz : ...........................
WMO_725000-729999.tar.gz : ....................
WMO_730000-799999.tar.gz : .......
WMO_800000-899999.tar.gz : ........
WMO_900000-999999.tar.gz : ........
#+end_example


* Write out the list of station data files

#+BEGIN_SRC sh :session :results silent
  cd hadisd2012
  # find . -name '*.nc4' > ../hadisd2012.files
  # don't want leading './'
  ls *.nc4 > ../hadisd2012.files
#+END_SRC

=parallel= offers ={.}= and ={/}= that may be useful if the speed of
=find= is required.  See =man parallel=.

#+BEGIN_SRC sh :session
  head hadisd2012.files
#+END_SRC

#+RESULTS:
#+begin_example
hadisd.1.0.0.2011f.501360-99999.nc4
hadisd.1.0.0.2011f.503530-99999.nc4
hadisd.1.0.0.2011f.504340-99999.nc4
hadisd.1.0.0.2011f.504680-99999.nc4
hadisd.1.0.0.2011f.505270-99999.nc4
hadisd.1.0.0.2011f.505480-99999.nc4
hadisd.1.0.0.2011f.505570-99999.nc4
hadisd.1.0.0.2011f.505640-99999.nc4
hadisd.1.0.0.2011f.506030-99999.nc4
hadisd.1.0.0.2011f.506320-99999.nc4
#+end_example


* TODO Tangle and run

#+BEGIN_SRC emacs-lisp
;;tangle function here
#+END_SRC

#+BEGIN_SRC sh :session
  chmod ug+x hadisd.sh
  chmod ug+x hadisd.R
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh :session
  # rm runtask.log
  sbatch hadisd.sbatch
#+END_SRC

#+RESULTS:
: Submitted batch job 6948289

